In [5]:
import pandas as pd

1. Creating DataFrames

In [30]:
data = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie','Diana'], 'Age': ['23','25','22','24'],'Gender': ['Female','Male','Male','Female'],'Score':['85','78','90','92']}, index=['', '', '', ''])
data

     Name Age  Gender Score
    Alice  23  Female    85
      Bob  25    Male    78
  Charlie  22    Male    90
    Diana  24  Female    92

Display the first 3 rows of the DataFrame. (2 Marks)

In [32]:
data.head(3)

     Name Age  Gender Score
    Alice  23  Female    85
      Bob  25    Male    78
  Charlie  22    Male    90

Get the column names and data types.

In [36]:
data.columns

Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')

Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False. (3 Marks)

In [49]:
data['Score'] = data['Score'].astype(int)
data['Passed'] = data['Score'] > 80
data

     Name Age  Gender  Score  Passed
    Alice  23  Female     85    True
      Bob  25    Male     78   False
  Charlie  22    Male     90    True
    Diana  24  Female     92    True

Drop the Gender column from the DataFrame.

In [52]:
data.drop('Gender', axis=1)

     Name Age  Score  Passed
    Alice  23     85    True
      Bob  25     78   False
  Charlie  22     90    True
    Diana  24     92    True

2. Indexing and Slicing (10 Marks)

Select and display only the Name and Score columns. (2 Marks)

In [56]:
data[['Name', 'Score']]

     Name  Score
    Alice     85
      Bob     78
  Charlie     90
    Diana     92

Filter and display rows where Score is greater than 85. (3 Marks)

In [63]:
data[data['Score'] > 85]

     Name Age  Gender  Score  Passed
  Charlie  22    Male     90    True
    Diana  24  Female     92    True

Display the row for the student named "Bob" using loc. (2 Marks)

In [66]:
data.loc[data['Name']=='Bob']

 Name Age Gender  Score  Passed
  Bob  25   Male     78   False

Display the last 2 rows of the DataFrame. (3 Marks)

In [75]:
data.iloc[-2:]

     Name Age  Gender  Score  Passed
  Charlie  22    Male     90    True
    Diana  24  Female     92    True

3. Data Analysis (15 Marks)

Calculate the average age of students. (2 Marks)

In [100]:
 data['Age'].mean()

TypeError: Could not convert string '23252224' to numeric

Find the maximum and minimum scores. (2 Marks)

In [92]:
 print(data['Score'].max())
 print(data['Score'].min())

92
78

Count the number of students who passed. (3 Marks)

In [103]:
data['Passed'].sum()

3

Group the data by the Passed column and calculate the average score for each group. (4 Marks)

In [106]:
data.groupby('Passed')['Score'].mean()

Passed
False    78.0
True     89.0
Name: Score, dtype: float64

Sort the DataFrame by Score in descending order. (4 Marks)

In [109]:
data.sort_values(by='Score', ascending=False)

     Name Age  Gender  Score  Passed
    Diana  24  Female     92    True
  Charlie  22    Male     90    True
    Alice  23  Female     85    True
      Bob  25    Male     78   False

5. Real-World Problem (10 Marks)

Create a DataFrame with the following sales data:

In [113]:
review = pd.DataFrame({'Product': ['Laptop', 'Smartphone', 'Desk','Chair'], 'Category': ['Electronics','Electronics','Furniture','Furniture'],'Sales': ['500','300','200','150'],'Discount':['50','30','20','15']}, index=['', '', '', ''])
review

     Product     Category Sales Discount
      Laptop  Electronics   500       50
  Smartphone  Electronics   300       30
        Desk    Furniture   200       20
       Chair    Furniture   150       15

Calculate a new column named Net Sales as Sales - Discount. (3 Marks)

In [126]:
review['Sales'] = pd.to_numeric(review['Sales'])
review['Discount'] = pd.to_numeric(review['Discount'])

review['Net Sales'] = review['Sales'] - review['Discount']
review

     Product     Category  Sales  Discount  Net Sales
      Laptop  Electronics    500        50        450
  Smartphone  Electronics    300        30        270
        Desk    Furniture    200        20        180
       Chair    Furniture    150        15        135

Group the data by Category and calculate total sales for each category. (4 Marks)

In [129]:
 review.groupby('Category')['Sales'].sum()

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

Find the product with the highest net sales. (3 Marks)